<a href="https://colab.research.google.com/github/sdw1621/0_LG/blob/main/PART_01_%ED%8C%90%EB%8B%A4%EC%8A%A4_%EC%9E%85%EB%AC%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 판다스 API 사이트
Application Programming Interface : 어플(앱) 응용 프로그램을 개발시 참고하는 사이트(개발자)

https://pandas.pydata.org/

### PDF 5 <예제 1-1>

In [ ]:
# 한글이 깨짐현상 방지 코드
# -*- coding: utf-8 -*- 

# pandas 불러오기
import pandas as pd

In [ ]:
# key:value 쌍으로 딕셔너리 만들기
# 변수 dict_data에 저장

dict_data = {'a': 1, 'b': 2, 'c' : 3}
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [ ]:
# dict_data(type : dictionary)
# 판다스 Series() 함수
# 형 변환
# 변수 sr에 저장

sr = pd.Series(dict_data)
print(sr)

a    1
b    2
c    3
dtype: int64

In [ ]:
# sr 자료형 출력
print(type(sr))
print('\n') # new line, 한 줄 띄어쓰기

<class 'pandas.core.series.Series'>

### PDF 7,<br> 시리즈 인덱스

In [ ]:
# -*- coding: utf-8 -*-

import pandas as pd

# 리스트 데이터는 여러 타입을 탑재할 수 있다 by 파이썬
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

# 리스트를 시리즈로 변환
# 변수 sr에 저장
sr = pd.Series(list_data)

# 시리즈형 변수 sr 안의 값 출력
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [ ]:
# -*- coding: utf-8 -*-

import pandas as pd

list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)

RangeIndex(start=0, stop=5, step=1)

In [ ]:
# 인덱스 배열은 변수 idx에 저장
idx = sr.index
print(idx)

RangeIndex(start=0, stop=5, step=1)

In [ ]:
# 데이터 값 배열은 변수 val에 저장
val = sr.values
print(val)

['2019-01-02' 3.14 'ABC' 100 True]

### PDF 9, 시리즈 원소 선택

In [ ]:
# -*- coding: utf-8 -*-

import pandas as pd

# 튜플 데이터형
tup_data = ('영인', '2010-05-01', '여', True)

# 판다스 시리즈 데이터형으로 변환
# 인덱스 옵션 지정
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별','학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [ ]:
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [ ]:
sr[0]

'영인'

In [ ]:
sr['이름']

'영인'

In [ ]:
print(sr[[1,2]])

생년월일    2010-05-01
성별               여
dtype: object

In [ ]:
# 열에 해당하는 데이터는 문자 인덱싱으로 작성하는게 가독성에 좋음
print(sr[['생년월일','성별']])

생년월일    2010-05-01
성별               여
dtype: object

In [ ]:
# 정수형 인덱스, 2 미만 번지라서 1번지만 출력
sr[1:2]

생년월일    2010-05-01
dtype: object

In [ ]:
# 문자형 인덱스
sr['생년월일':'성별']

생년월일    2010-05-01
성별               여
dtype: object

### PDF 13, 딕셔너리 -> 데이터프레임 변환

In [ ]:
# -*- coding: utf-8 -*-

import pandas as pd

# 샘플 형태를 하나를 잘 작성하고, 복사 붙여넣기 사용
# Ctrl + 방향키를 통해서 키보드 수정 편의
# 한 줄 띄어서 작성하고 싶을 때에는 쉼표 다음에 Enter
dict_data = {
             'c0':[1,2,3], 'c1':[4,5,6],
             'c2':[7,8,9], 'c3':[10,11,12],
             'c4':[13,14,15]
            }

In [ ]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

### PDF 14, 행 인덱스/열 이름 설정

In [ ]:
df = pd.DataFrame([ [15, '남', '덕영중'], [17, '여', '수리중'] ],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교']
                 )
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [ ]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [ ]:
print(df.index)

Index(['준서', '예은'], dtype='object')

In [ ]:
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [ ]:
df.index = ['학생1', '학생2']
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [ ]:
df.columns = ['연령', '남녀', '소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

### PDF 16, 행 인덱스/열 이름 변경

In [ ]:
df = pd.DataFrame([ [15, '남', '덕영중'], [17, '여', '수리중'] ],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교']
                 )
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [ ]:
df.rename(columns = {"나이":"연령", "성별":"남녀", "학교":"소속"}, inplace=True)

# df.rename(index = {"준서":"학생1", "예은":"학생2"}, inplace=True)
df.rename(index = {"연령":"학생1", "남녀":"학생2"}, inplace=True)

df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

### PDF 18, 행 삭제

In [ ]:
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95],
            '음악' : [85, 95, 100],'체육' : [100, 90, 90]}
print(exam_data)

{'수학': [90, 80, 70], '영어': [98, 89, 95], '음악': [85, 95, 100], '체육': [100, 90, 90]}

In [ ]:
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df2 = df[:] # 원본(보존)에서 복사본으로 작업해 보기
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df2.drop('우현', inplace=True)
df2

C:\Users\14T90N-VR56K\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
df3 = df[:]
df3.drop(['우현','인아'], axis=0, inplace=True)
df3

C:\Users\14T90N-VR56K\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  영어  음악   체육
서준  90  98  85  100

In [ ]:
df4 = df[:]
df4.drop(['우현','인아'], axis=0)
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### PDF 20, 열 삭제

In [ ]:
df4 = df[:]
df4.drop('수학', axis=1, inplace=True)
df4

C:\Users\14T90N-VR56K\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [ ]:
df5 = df[:]
df5.drop( ['영어','수학'], axis=1, inplace=True)
df5

C:\Users\14T90N-VR56K\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [ ]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
label1 = df.loc['서준']
print(label1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
position1 = df.iloc[0]
position1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
label2 = df.loc[ ['서준','우현'] ]
print(label2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
position2 = df.iloc[ [0,1] ]
position2

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
label3 = df.loc['서준':'우현']
print(label3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [ ]:
position3 = df.iloc[0:1]
position3

    수학  영어  음악   체육
서준  90  98  85  100

### PDF 24, 열 선택

In [ ]:
exam_data = {
    '이름' : ['서준','우현','인아'],
    '수학' : [90, 80, 70],
    '영어' : [98, 89, 95],
    '음악' : [85, 95, 100],
    '체육' : [100, 90, 90]
}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
math1 = df['수학']
print(math1)

0    90
1    80
2    70
Name: 수학, dtype: int64

In [ ]:
english = df.영어
print(english)

0    98
1    89
2    95
Name: 영어, dtype: int64

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
print(type(math1))

<class 'pandas.core.series.Series'>

In [ ]:
print(type(english))

<class 'pandas.core.series.Series'>

### PDF 26, 열 선택

In [ ]:
music_gym = df[ ['음악','체육'] ]
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90
<class 'pandas.core.frame.DataFrame'>

In [ ]:
math2 = df['수학']
print(math2)
print(type(math2))

0    90
1    80
2    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
math3 = df[['수학']]
print(math3)
print(type(math3))

   수학
0  90
1  80
2  70
<class 'pandas.core.frame.DataFrame'>

### PDF 28, 원소 선택

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### PDF 29, 원소 선택

In [ ]:
a = df.loc['서준','음악']
print(a)

85

In [ ]:
b = df.iloc[0, 2]
print(b)

85

In [ ]:
c = df.loc['서준', ['음악','체육']]
print(c)

음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
d = df.iloc[0, [2,3]]
print(d)

음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
e = df.loc['서준', '음악':'체육']
print(e)

음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
f = df.iloc[0, 2:]
print(f)

음악     85
체육    100
Name: 서준, dtype: int64

In [ ]:
g = df.loc[ ['서준','우현'], ['음악', '체육'] ]
print(g)

    음악   체육
이름
서준  85  100
우현  95   90

In [ ]:
h = df.iloc[ [0, 1], [2, 3] ]
print(h)

    음악   체육
이름
서준  85  100
우현  95   90

In [ ]:
i = df.loc['서준':'우현', '음악':'체육']
print(i)

    음악   체육
이름
서준  85  100
우현  95   90

In [ ]:
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90

In [ ]:
exam_data

{'이름': ['서준', '우현', '인아'],
 '수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### PDF 32, 열 추가

In [ ]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

### PDF 33, 행 추가

In [ ]:
exam_data

{'이름': ['서준', '우현', '인아'],
 '수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [ ]:
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [ ]:
df.loc[4] = ['동규', 90, 80, 70, 60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [ ]:
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

### PDF 35, 원소 값 변경

In [ ]:
exam_data

{'이름': ['서준', '우현', '인아'],
 '수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [ ]:
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [ ]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [ ]:
df.loc['서준','체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [ ]:
df.loc['서준',['음악','체육']] = 100, 50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

### PDF 38, 행, 열 바꾸기

In [ ]:
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [ ]:
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### PDF 39, 특정 열을 행 인덱스로 설정

In [ ]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [ ]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
ndf2 = df.set_index(['음악'])
ndf2

     이름  수학  영어   체육
음악
85   서준  90  98  100
95   우현  80  89   90
100  인아  70  95   90

In [ ]:
ndf3 = df.set_index(['수학','음악'])
ndf3

        이름  영어   체육
수학 음악
90 85   서준  98  100
80 95   우현  89   90
70 100  인아  95   90

### PDF 41, 새로운 배열로 행 인덱스 재지정

In [ ]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [ ]:
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
new_index = ['r0','r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [ ]:
new_index = ['r0','r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value = 0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

### PDF 42, 정수형 위치 인덱스 초기화

In [ ]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

### PDF 43, 데이터프레임 정렬

In [ ]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
ndf = df.sort_index(ascending = False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

### PDF 45, 열 기준 정렬

In [ ]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [ ]:
ndf = df.sort_values(by='c1', ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

### PDF 46, 시리즈를 숫자로 나누기

In [ ]:
student1 = pd.Series({ '국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [ ]:
percentage = student1 / 200
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [ ]:
print(type(percentage))

<class 'pandas.core.series.Series'>

### PDF 47, 시리즈 사칙연산

In [ ]:
student1 = pd.Series( {'국어':100, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90, '영어':80} )

In [ ]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [ ]:
student2

수학    80
국어    90
영어    80
dtype: int64

In [ ]:
addition = student1 + student2
addition

국어    190
수학    170
영어    160
dtype: int64

In [ ]:
subtraction = student1 - student2
subtraction

국어    10
수학    10
영어     0
dtype: int64

In [ ]:
print(type(subtraction))

<class 'pandas.core.series.Series'>

In [ ]:
result = pd.DataFrame([addition, subtraction],
                     index=['덧셈', '뺄셈'])
result

     국어   수학   영어
덧셈  190  170  160
뺄셈   10   10    0

### PDF 49, NaN 값이 있는 시리즈 연산

In [ ]:
student1 = pd.Series( {'국어':np.nan, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90} )

In [ ]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [ ]:
student2

수학    80
국어    90
dtype: int64

In [ ]:
addition = student1 + student2
addition

국어      NaN
수학    170.0
영어      NaN
dtype: float64

In [ ]:
subtraction = student1 - student2
subtraction

국어     NaN
수학    10.0
영어     NaN
dtype: float64

In [ ]:
result = pd.DataFrame([addition, subtraction],
                     index=['덧셈', '뺄셈'])
result

    국어     수학  영어
덧셈 NaN  170.0 NaN
뺄셈 NaN   10.0 NaN

### PDF 51, 연산 메소드 사용 - 시리즈 연산

In [ ]:
student1 = pd.Series( {'국어':np.nan, '영어':80, '수학':90} )
student2 = pd.Series( {'수학':80, '국어':90} )

In [ ]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [ ]:
student2

수학    80
국어    90
dtype: int64

In [ ]:
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)

In [ ]:
sr_add

국어     90.0
수학    170.0
영어     80.0
dtype: float64

In [ ]:
sr_sub

국어   -90.0
수학    10.0
영어    80.0
dtype: float64

### PDF 53, 데이터프레임에 숫자 더하기

In [ ]:
# -*- coding : utf-8 -*-

import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
df = titanic.loc[ : ,['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [ ]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [ ]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
addition = df + 10
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [ ]:
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500